Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Horizontal layout direction of this view is inherited from its parent.
zh_cn: 此 view 的水平布局方向从其父级继承。

source: HorizontalScrollView only supports horizontal scrolling.
zh_cn: Horizo​​ntalScrollView 仅支持水平滚动。

source: Hot start
zh_cn: 热启动（Hot start）

source: How the elements of the horizontal chain will be positioned.
zh_cn: 水平链的元素如何定位。

source: How the elements of the vertical chain will be positioned.
zh_cn: 垂直链的元素如何定位。

source: How to calculate the size of a view in 0 dp by using its wrap_content size
zh_cn: 如何使用其 wrap_content 大小来计算 0 dp 中的 view 大小

source: However these software-rendered usages are discouraged and have compatibility issues with hardware-only rendering features such as Config.HARDWARE bitmaps, real-time shadows, and outline clipping.
zh_cn: 但是，不建议使用这些软件渲染的用法，并且与仅硬件渲染功能(例如 Config.HARDWARE 位图，实时阴影和轮廓剪辑)存在兼容性问题。

source: However, a TableLayout can specify certain columns as shrinkable or stretchable by calling setColumnShrinkable() or setColumnStretchable().
zh_cn: 但是，TableLayout 可以通过调用 setColumnShrinkable() 或 setColumnStretchable() 将某些列指定为可收缩或可伸缩的。

source: However, all the string building that happens for these calls still gets executed.
zh_cn: 不过，为这些调用编译的所有字符串仍会得以执行。

source: However, contrary to a CheckBox, a radio button cannot be unchecked by the user once checked.
zh_cn: 但是，与 CheckBox 相反，单选按钮一旦选中，用户就无法取消选中。

source: However, even this case can be avoided by encapsulating the try-catch block in a method:
zh_cn: 不过，即使是这种情况，也可以通过将 try-catch 块封装在某个方法中来避免：

source: However, future calls to modify the hint will not update TextInputLayout's hint.
zh_cn: 但是，将来修改提示的调用不会更新 TextInputLayout 的提示。

source: However, if some memory has been purged in response to memory trimming events, such as onTrimMemory(), then those objects will need to be recreated in response to the hot start event.
zh_cn: 但是，如果为响应内存修整事件（如 onTrimMemory()）而清除了某些内存，则需要重新创建这些对象以响应热启动事件。

source: However, if the given dimension has only one constraint, then the view expands to fit its contents.
zh_cn: 但是，如果给定尺寸只有一个约束，则 view 将扩展以适合其内容。

source: However, it takes a significant amount of time for the system to render each VectorDrawable object, and larger images take even longer to appear on the screen.
zh_cn: 但是，系统需要花费大量时间来渲染每个 VectorDrawable 对象，并且较大的图像需要更长的时间才能显示在屏幕上。

source: However, simulating the feel of a flywheel isn't trivial.
zh_cn: 然而，模拟飞轮的感觉并非无足轻重。

source: However, the layout_height attribute can be defined by a child; default value is ViewGroup.LayoutParams.WRAP_CONTENT.
zh_cn: 但是，layout_height 属性可以由子项定义；默认值为 ViewGroup.LayoutParams.WRAP_CONTENT。

source: However, this approach can result in a longer startup time than apps that don’t suppress the preview window.
zh_cn: 但是，与不抑制预览窗口的应用程序相比，此方法可以导致更长的启动时间。

source: However, this is only to make editing easier; if a view has no constraints when you run your layout on a device, it is drawn at position [0,0] (the top-left corner).
zh_cn: 然而这个仅仅是让编辑的时候更容易而已，如果这个 View 没有任何约束，当你运行应用到在设备上，他将会被绘制到左上角[0,0]这个位置。

source: However, view groups provide such a support.
zh_cn: 然而，view group 提供 margin 的支持。

source: However, you can still override them if you need to.
zh_cn: 当然，如果需要你也可以重写。

source: However, you can use wrap_content if the ExpandableListView parent has a specific size, such as 100 pixels.
zh_cn: 但是，如果 ExpandableListView 父级具有特定大小(例如 100 像素)，则可以使用 wrap_content。

source: Humans can easily follow the style.
zh_cn: 用户可以轻松遵循的样式。

source: IDEs can follow the style.
zh_cn: IDE 可以遵循的样式。

source: Icon drawable to use for the collapse button.
zh_cn: drawable 的图标用于折叠按钮。

source: Icon drawable to use for the navigation button located at the start of the toolbar.
zh_cn: drawable 的图标，用于位于工具栏开头的导航按钮。

source: Identifier for the animation to use when a view is hidden.
zh_cn: 隐藏 view 时要使用的动画的标识符。

source: Identifier for the animation to use when a view is shown.
zh_cn: 显示 view 时要使用的动画的标识符。

source: Identifier for the child that represents the drawer's content.
zh_cn: 表示抽屉内容的子项的标识符。

source: Identifier for the child that represents the drawer's handle.
zh_cn: 表示抽屉手柄的子项的标识符。

source: Identifying bottlenecks
zh_cn: 识别瓶颈

source: If #hasStableIds() would return false this method should return #NO_ID.
zh_cn: 如果 #hasStableIds() 将返回 false，则此方法应返回 #NO_ID。

source: If inJustDecodeBounds is set to false, this will be height of the output bitmap after any scaling is applied.
zh_cn: 如果 inJustDecodeBounds 设置为 false，则在应用任何缩放后，这将是输出位图的高度。

source: If inJustDecodeBounds is set to false, this will be width of the output bitmap after any scaling is applied.
zh_cn: 如果 inJustDecodeBounds 设置为 false，那么在应用任何缩放后，这将是输出位图的宽度。

source: If true, decodeDrawable will return an AnimatedImageDrawable.
zh_cn: 如果 true，decodeDrawable 将返回 AnimatedImageDrawable。

source: If null, colors are distributed evenly between the center and edge of the circle.
zh_cn: 如果为 null，颜色均匀分布在圆的中心和边缘之间。

source: If color is not opaque, consider setting View.SYSTEM_UI_FLAG_LAYOUT_STABLE and View.SYSTEM_UI_FLAG_LAYOUT_FULLSCREEN.
zh_cn: 如果 color 不透明，请考虑设置 View.SYSTEM_UI_FLAG_LAYOUT_STABLE 和 View.SYSTEM_UI_FLAG_LAYOUT_FULLSCREEN 。

source: If onPartialImage returns true, a partial image will be created.
zh_cn: 如果 onPartialImage 返回 true，将创建​​部分图像。

source: If FOREVER_NS is passed, this method will not fail to create/bind the holder if needed.
zh_cn: 如果传递了 FOREVER_NS，则如果需要，此方法将会创建/绑定 holder 而不会失败。

source: If ViewHolder isRecyclable is false, recycleViewHolderInternal() will not recycle it, endAnimation() will reset isRecyclable flag and recycle the view.
zh_cn: 如果 ViewHolder isRecyclable 为 false，则 recycleViewHolderInternal() 将不回收它，endAnimation() 将重置 isRecyclable 标志并回收 view。

source: If a TableRow's parent is not a TableLayout, the TableRow will behave as an horizontal LinearLayout.
zh_cn: 如果 TableRow 的父级不是 TableLayout，则 TableRow 将表现为水平 LinearLayout。

source: If a View object sets the NinePatch as its background and then specifies the View's text, it will stretch itself so that all the text fits inside only the area designated by the right and bottom lines (if included).
zh_cn: 如果一个 View 对象设置了 NinePatch 作为它的背景，并申明的 view 的文字，它将缩放自己以使得所有的文字处于右边和上边的线申明的区域内。(如果包含右边或上边的线)。

source: If a ViewHolder is aquired and must be bound but not enough time remains, an unbound holder is returned.
zh_cn: 如果获取了一个 ViewHolder 并且必须被绑定，但是没有足够的时间，则返回一个未绑定的 holder。

source: If a ViewHolder must be constructed and not enough time remains, null is returned.
zh_cn: 如果必须构造一个 ViewHolder，并且没有足够的时间，则返回 null。

source: If a child does not specify the row and column indices of the cell it wishes to occupy, GridLayout assigns cell locations automatically using its: GridLayout#setOrientation(int), GridLayout#setRowCount(int) and GridLayout#setColumnCount(int) properties.
zh_cn: 如果子项没有指定它希望占用的单元格的行和列索引，GridLayout 将使用以下命令自动分配单元格位置：GridLayout#setOrientation(int)，GridLayout#setRowCount(int) 和 GridLayout#setColumnCount(int) 属性。

source: If a child view's LayoutParams indicates a Gravity value of Gravity#CENTER_HORIZONTAL the view will attempt to center within the available space remaining in the Toolbar after all other elements have been measured.
zh_cn: 如果子 view 的 LayoutParams 指定了 Gravity#CENTER_HORIZONTAL 的 Gravity 值，在测量完所有其他元素后，view 将尝试在工具栏中剩余的可用空间内居中。

source: If a child view's Toolbar.LayoutParams indicates a Gravity value of CENTER_HORIZONTAL the view will attempt to center within the available space remaining in the Toolbar after all other elements have been measured.
zh_cn: 如果子 view 的 Toolbar.LayoutParams 指定了值为 CENTER_HORIZONTAL 的 Gravity，在测量完所有其他元素后，view 将尝试以工具栏中剩余的可用空间为中心。

source: If a comment line contains an example command or a literal URL longer than 100 characters, that line may be longer than 100 characters for ease of cut and paste.
zh_cn: 如果备注行包含长度超过 100 个字符的示例命令或文字网址，那么为了便于剪切和粘贴，该行可以超过 100 个字符。

source: If a custom view not equipped to properly measure with the MeasureSpec mode UNSPECIFIED was placed in a RelativeLayout, this would silently work anyway as RelativeLayout would pass a very large AT_MOST MeasureSpec instead.
zh_cn: 如果未通过 MeasureSpec 模式 UNSPECIFIED 进行正确测量的自定义 view 被放置在 RelativeLayout 中，那么无论如何，这将无声地工作，因为 RelativeLayout 将传递非常大的 AT_MOST MeasureSpec。

source: If a deadlineNs other than #FOREVER_NS is passed, this method early return rather than constructing or binding a ViewHolder if it doesn't think it has time.
zh_cn: 如果传递了除 #FOREVER_NS 以外的 deadlineNs，则此方法在它认为没有时间的情况下将提前返回，而不会构造或绑定 ViewHolder。

source: If a hint is specified on the child EditText in XML, the TextInputLayout might still work correctly; TextInputLayout will use the EditText's hint as its floating label.
zh_cn: 如果在 XML 中的子 EditText 上指定了提示，则 TextInputLayout 可能仍然可以正常工作；TextInputLayout 将使用 EditText 的提示作为其浮动标签。

source: If a library was designed for a server or desktop, it can include many objects and methods that your app doesn’t need.
zh_cn: 如果库是为服务器或桌面设计的，则它可以包含你的应用程序不需要的许多对象和方法。

source: If a method exceeds 40 lines or so, think about whether it can be broken up without harming the structure of the program.
zh_cn: 如果某个方法的代码超出 40 行，请考虑是否可以在不破坏程序结构的前提下对其拆解。

source: If a nested scrolling child view would normally fling but it is at the edge of its own content, it can use this method to delegate the fling to its nested scrolling parent instead.
zh_cn: 如果嵌套的滚动子 view 正常 fling 但它位于其自己内容的边缘，则可以使用此方法将 fling 委托给其嵌套的滚动父级。

source: If a nested scrolling parent is consuming motion as part of a pre-scroll, it may be appropriate for it to also consume the pre-fling to complete that same motion.
zh_cn: 如果嵌套滚动父级将 pre-scroll 的一部分动作消耗，则它也可能适合消耗 pre-fling 来完成相同的动作。

source: If a single thread issues a sequence of method invocations that violates the contract of an object, the object may throw this exception.
zh_cn: 如果单线程发出违反对象协定的方法调用序列，则该对象可能抛出此异常。

source: If a start-aligned icon is added to this button, please use a style like one of the ".Icon" styles specified in the default MaterialButton styles.
zh_cn: 如果向此按钮添加了一个开始对齐的图标，请使用类似于默认 MaterialButton 样式中指定的“.Icon”样式之类的样式。

source: If a variable is initialized with the return value of a method that throws a checked exception, it must be initialized inside a try block.
zh_cn: 如果通过一个会抛出受检异常的方法的返回值来初始化变量，则必须在 try 块中进行初始化。

source: If a warning passes this "impossible to eliminate" test, the @SuppressWarnings annotation must be used, so as to ensure that all warnings reflect actual problems in the code.
zh_cn: 如果某个警告通过了 "无法消除" 测试，则必须使用 @SuppressWarnings 注释，以确保所有警告都会反映出代码中的实际问题。

source: If all of your application’s activities are still resident in memory, then the app can avoid having to repeat object initialization, layout inflation, and rendering.
zh_cn: 如果所有应用程序的 activity 仍然驻留在内存中，那么应用程序可以避免重复对象初始化，布局加载和渲染。

source: If an anchor is present the keyline will be ignored.
zh_cn: 如果存在 anchor，则将忽略 keyline。

source: If an anchor is also specified, the gravity describes how this child view should be positioned relative to its anchored position.
zh_cn: 如果还指定了 anchor，则 gravity 描述了此子 view 相对于其锚定位置的定位方式。

source: If an activity wishes to show just the progress animation, it should call setRefreshing(true).
zh_cn: 如果 activity 希望仅显示进度动画，则应调用 setRefreshing(true)。

source: If an app uses a logo image it should strongly consider omitting a title and subtitle.
zh_cn: 如果应用使用 logo 图片，则应强烈考虑省略标题和副标题。

source: If an instance is passed to setOnPartialImageListener, a DecodeException that would otherwise have been thrown can be inspected inside onPartialImage.
zh_cn: 如果实例被传递到 setOnPartialImageListener，则本应抛出的 DecodeException 可以在 onPartialImage 内进行检查。

source: If an item view has large or expensive data bound to it such as large bitmaps, this may be a good place to release those resources.
zh_cn: 如果项目 view 绑定了大量或昂贵的数据(如大型位图)，则这可能是释放这些资源的好地方。

source: If an uncaught exception is thrown by the finalize method, the exception is ignored and finalization of that object terminates.
zh_cn: 如果 finalize 方法引发未捕获的异常，则忽略该异常，并终止该对象的终止。

source: If any sibling views before this one do not have this flag, then this value has no effect.
zh_cn: 如果在此之前的任何兄弟 view 没有此标志，则此值无效。

source: If applied to an int array, every element in the array represents a color integer.
zh_cn: 如果应用于一个 int 数组，数组中的每个元素都代表一个颜色的整型。

source: If both the width and height are set to match constraints, you can click Toggle Aspect Ratio Constraint to select which dimension is based on a ratio of the other.
zh_cn: 如果宽度和高度都设置为 match constraints，你可以单击 Toggle Aspect Ratio Constraint 来选择哪个尺寸基于另一个比率。

source: If combined with setTargetSize(int, int) and/or setCrop(Rect), PostProcessor.onPostProcess(Canvas) occurs last.
zh_cn: 如果与 setTargetSize(int, int) 和/或 setCrop(Rect) 组合，PostProcessor.onPostProcess(Canvas) 最后发生。

source: If decoding is interrupted after having decoded a partial image, this method will be called.
zh_cn: 如果在解码部分图像之后中断解码，则将调用该方法。

source: If either requestLayout() or invalidate() were called, the framework will take care of measuring, laying out, and drawing the tree as appropriate.
zh_cn: 如果 requestLayout() 或者 invalidate() 被调用，框架将负责计算、布局及绘制适当的 view 树。

source: If either a weight or alignment were defined along a given axis then the component is taken as flexible in that direction.
zh_cn: 如果沿给定轴定义了权重或对齐，则该组件在该方向上被视为 flexible (灵活)。

source: If either or both of the axes are not specified, they are treated by CoordinatorLayout as TOP or START.
zh_cn: 如果未指定其中一个或两个轴，则 CoordinatorLayout 将它们视为 TOP 或 START。

source: If false, no state will be saved for this view when it is being frozen.
zh_cn: 如果为 false，则在冻结此 view 时不会保存任何状态。

source: If false, the chip acts like a button.
zh_cn: 如果为 false，chip 就像一个按钮。

source: If gravity was defined, then the gone-marked view has no effect on the layout and the container should be laid out as if the view had never been added to it.
zh_cn: 如果定义了重力，则标记 gone 的 view 对布局没有影响，并且应该布置容器，就好像从未添加过 view 一样。

source: If in the course of processing the event, the view's bounds may need to be changed, the view will call requestLayout().
zh_cn: 在处理事件的过程中，如果 view 的边界可能需要改变，view 将会调用 requestLayout() 方法。

source: If inPurgeable is false, then this field is ignored.
zh_cn: 如果 inPurgeable 为 false，则该字段将被忽略。

source: If inPurgeable is true, then this field determines whether the bitmap can share a reference to the input data (inputstream, array, etc.) or if it must make a deep copy.
zh_cn: 如果 inPurgeable 为 true，那么此字段确定位图是否可以共享对输入数据(输入流，数组等)的引用，或者是否必须进行深度复制。

source: If intercepted, start normal event dispatch.
zh_cn: 如果被拦截，启动正常事件分发。

source: If it cannot find a suitable View, Recycler will call the #getViewForPositionAndType(Recycler, int, int) before checking RecycledViewPool.
zh_cn: 如果找不到合适的 view，Recycler 将在检查 RecycledViewPool 之前调用 #getViewForPositionAndType(Recycler, int, int)。

source: If it finds conflicting measurements, it may need to traverse the hierarchy multiple times.
zh_cn: 如果发现有冲突的测量，则可能需要多次遍历层次结构。

source: If it has declared its launch mode to be "multiple" (the default) and you have not set FLAG_ACTIVITY_SINGLE_TOP in the same intent, then it will be finished and re-created; for all other launch modes or if FLAG_ACTIVITY_SINGLE_TOP is set then this Intent will be delivered to the current instance's onNewIntent().
zh_cn: 如果它已声明其启动模式为“multiple”(默认值)，并且你没有在相同的 intent 中设置 FLAG_ACTIVITY_SINGLE_TOP，则它将 finish 并重新创建；对于所有其他启动模式，或者如果设置了 FLAG_ACTIVITY_SINGLE_TOP，则此 intent 将传递到当前实例的 onNewIntent()。

source: If it is null, which is the default, or the request cannot be met, the decoder will pick either the color space embedded in the image or the ColorSpace best suited for the requested image configuration (for instance sRGB for the Bitmap.Config.ARGB_8888 configuration).
zh_cn: 如果它为 null（默认值）或无法满足请求，解码器将选择图像中嵌入的颜色空间或 ColorSpace 最适合于请求的映像配置（例如 sRGB 用于 Bitmap.Config.ARGB_8888 配置）。

source: If it isn't, it means that a fling or programmatic pan operation is still in progress.
zh_cn: 如果不是，则意味着仍在进行 fling 或 programmatic pan 操作。

source: If it returns true, this ViewParent will become the target view's nested scrolling parent for the duration of the scroll operation in progress.
zh_cn: 如果返回 true，则此 ViewParent 将在正在进行的滚动操作期间成为目标 view 的嵌套滚动父级。

source: If it's not obvious what the property "Foo" means, you should document it.
zh_cn: 如果属性 "Foo" 的意思不明确，你也应该添加备注。

source: If known, the color space the decoded bitmap will have.
zh_cn: 如果已知，则解码的位图将具有的颜色空间。

source: If known, this string is set to the mimetype of the decoded image.
zh_cn: 如果已知，则将该字符串设置为解码图像的 mimetype。

source: If margins are specified on connections, they will be taken in account.
zh_cn: 如果在链上指定了 margins，它们将会被考虑在内。

source: If marked as shrinkable, the column width can be shrunk to fit the table into its parent object.
zh_cn: 如果标记为可收缩，则可以缩小列宽以使表适合其父对象。

source: If marked as stretchable, it can expand in width to fit any extra space.
zh_cn: 如果标记为可拉伸，则可以扩展宽度以适应任何额外空间。

source: If mode is null, then SRC_OVER is assumed.
zh_cn: 如果模式为空，则假定为 SRC_OVER。

source: If no match has yet been attempted, or if the previous match operation failed
zh_cn: 如果没有尝试任何匹配或者以前的匹配操作失败

source: If no weight or alignment was set, the component is instead assumed to be inflexible.
zh_cn: 如果没有设置权重或对齐，则假定该组件 inflexible (不灵活)。

source: If non-null, the decoder will try to decode into colorSpace.
zh_cn: 如果为非 null，则解码器将尝试解码为 colorSpace。

source: If none of the prebuilt widgets or layouts meets your needs, you can create your own View subclass.
zh_cn: 如果预制的组件和布局都不能满足你的需求，你可以创建自己的 View 子类。

source: If not know, or there is an error, it is set to null.
zh_cn: 如果不知道，或者有错误，则将其设置为空。

source: If not known (when the config is Bitmap.Config.ALPHA_8 for instance), or there is an error, it is set to null.
zh_cn: 如果未知(例如，当配置 Bitmap.Config.ALPHA_8 时)，或者存在错误，则将其设置为 null。

source: If one or more elements are using MATCH_CONSTRAINT, they will use the available empty space (equally divided among themselves).
zh_cn: 如果一个或多个元素使用 MATCH_CONSTRAINT，它们将使用可用的空白空间(在它们之前平分)。

source: If positions is NULL, then the colors are automatically spaced evenly.
zh_cn: 如果位置为 NULL，则颜色自动均匀分布。

source: If possible, consider using the @IntDef annotation and ProGuard to strip enumerations out and convert them to integers.
zh_cn: 如果可能，请考虑使用 @IntDef 注释和 ProGuard 来删除枚举并将其转换为整数。

source: If pre-layout, check the changed scrap for an exact match.
zh_cn: 如果预先布局，检查更改的废料是否完全匹配。

source: If requested, can automatically flip between each child at a regular interval.
zh_cn: 如果需要，可以定期在每个子项之间自动翻转。

source: If set and this intent is being used to launch a new activity from an existing one, the current activity will not be counted as the top activity for deciding whether the new intent should be delivered to the top instead of starting a new one.
zh_cn: 如果设置并且这个 intent 用于从现有的一个新的 activity 中启动，当前 activity 将不被视为决定新的 intent 是否应该被交付到顶层而不是启动新的 activity 的顶部 activity。

source: If set and this intent is being used to launch a new activity from an existing one, then the reply target of the existing activity will be transfered to the new activity.
zh_cn: 如果设置并且这个 intent 用于从现有的一个 activity 中启动新的 activity，那么现有 activity 的回复目标将被转移到新的 activity。

source: If set in an Intent passed to Context.startActivity(), this flag will cause a newly launching task to be placed on top of the current home activity task (if there is one).
zh_cn: 如果在传递给 Context.startActivity() 的 intent 中设置，则此标志将导致新启动的 task 置于当前主 activity task 的顶部(如果有)。

source: If set in an Intent passed to Context.startActivity(), this flag will cause any existing task that would be associated with the activity to be cleared before the activity is started.
zh_cn: 如果在传入 Context.startActivity() 的 Intent 中设置，该标志将导致将与 activity 相关的任何现有 task 在 activity 开始之前被清除。

source: If set in an Intent passed to Context.startActivity(), this flag will cause the launched activity to be brought to the front of its task's history stack if it is already running.
zh_cn: 如果在传递给 Context.startActivity() 的 intent 中设置此标志，则如果已启动的 activity 已在运行，则此标志将导致其被带到任务历史堆栈的前面。

source: If set in an Intent passed to Context.startActivity(), this flag will prevent the system from applying an activity transition animation to go to the next activity state.
zh_cn: 如果在传递给 Context.startActivity() 的 intent 中设置，则此标志将阻止系统应用 activity 转换动画以转到下一个 activity 状态。

source: If set on a nine-patch image, the nine-patch data is ignored.
zh_cn: 如果设置在 .9 图像上，则忽略 .9 数据。

source: If set to a value > 1, requests the decoder to subsample the original image, returning a smaller image to save memory.
zh_cn: 如果设置为大于 1 的值，则请求解码器对原始图像进行二次采样，返回较小的图像以节省存储空间。

source: If set to true, the AppBarLayout will animate to the lifted, or elevated, state when content is scrolled beneath it.
zh_cn: 如果设置为 true，则 AppBarLayout 将动画到 lifted 或 elevated 状态，当其下方内容滚动时。

source: If set to true, the decoder will return null (no bitmap), but the out...
zh_cn: 如果设置为 true，解码器将返回 null (无位图)，但...

source: If set, a button is displayed to toggle between the password being displayed as plain-text or disguised, when your EditText is set to display a password.
zh_cn: 如果设置，则当 EditText 设置为显示密码时，将显示一个按钮，用于在显示为纯文本或伪装的密码之间切换。

source: If set, a button is displayed when text is present and clicking it clears the EditText field.
zh_cn: 如果设置，则在显示文本时会显示一个按钮，单击它会清除 EditText 字段。

source: If set, and the activity being launched is already running in the current task, then instead of launching a new instance of that activity, all of the other activities on top of it will be closed and this Intent will be delivered to the (now on top) old activity as a new Intent.
zh_cn: 如果设置，并且正在启动的 activity 已在当前 task 中运行，则不会启动该 activity 的新实例，而是关闭其上的所有其他 activity，并将此 intent 作为新 intent 传递给(现在位于顶部)旧 activity。

source: If set, and this activity is either being started in a new task or bringing to the top an existing task, then it will be launched as the front door of the task.
zh_cn: 如果设置，这个 activity 要么是在一个新 task 中启动，要么是放到一个现有 task 顶层，然后它将作为 task 的前门启动。

source: If set, decode methods that take the Options object will attempt to reuse this bitmap when loading content.
zh_cn: 如果设置，则在加载内容时，采用 Options 对象的解码方法将尝试重新使用此位图。

source: If set, decode methods will always return a mutable Bitmap instead of an immutable one.
zh_cn: 如果设置，解码方法将始终返回一个可变的位图而不是不可变的位图。

source: If set, the activity will not be launched if it is already running at the top of the history stack.
zh_cn: 如果设置，则如果 activity 已在历史堆栈顶部运行，则不会启动该 activity。

source: If set, the new activity is not kept in the history stack.
zh_cn: 如果设置，则新 activity 不会保留在历史堆栈中。

source: If set, the new activity is not kept in the list of recently launched activities.
zh_cn: 如果设置，则新 activity 不会保留在最近启动的 activity 列表中。

source: If set, the system bars are drawn with a transparent background and the corresponding areas in this window are filled with the colors specified in Window.getStatusBarColor() and Window.getNavigationBarColor().
zh_cn: 如果设置，系统条将以透明背景绘制，并且此窗口中的相应区域将填充 Window.getStatusBarColor() 和 Window.getNavigationBarColor() 指定的颜色。

source: If set, the view will be snapped to its top and bottom margins, as opposed to the edges of the view itself.
zh_cn: 如果设置，view 将捕捉到其顶部和底部边距，而不是 view 的边缘。

source: If set, this activity will become the start of a new task on this history stack.
zh_cn: 如果设置，此 activity 将成为此历史堆栈上新任务的开始。

source: If set, this flag will prevent the normal onUserLeaveHint() callback from occurring on the current frontmost activity before it is paused as the newly-started activity is brought to the front.
zh_cn: 如果设置了此标志，则在当前最前面的 activity 暂停之前，此标志将阻止在当前最前面的 activity 上发生正常的 onUserLeaveHint() 回调，因为新启动的 activity 被带到前面。

source: If side margins are set, they will be applied to the corresponding constraints (if they exist) (Fig. 3), enforcing the margin as a space between the target and the source side.
zh_cn: 如果设置了边界的 margins，它们将被应用于相应的约束(如果存在)(图 3)，将边距作为目标和源端之间的空间。

source: If so, then it is an error to try use its method.
zh_cn: 如果是这样，那么尝试使用它的方法会出错。

source: If that code uses spaces around the if clauses, you should too.
zh_cn: 如果该代码在 if 语句周围使用空格，那么你也应该这样做。
